[
  {
    "__catalogCourseId": "BSCI1001",
    "title": "Commons iSeminar",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Topics vary. General Elective credit only. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI1100",
    "title": "Biology Today",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": ["BSCI1100L"],
      "description": "Biological Sciences"
    },
    "description": "Broad coverage of the biological sciences presenting evolution as the unifying concept. Particular emphasis on basic biological processes in cells and the relationships/interactions between organisms and their environment. Topics include cell structure and function, genetics and inheritance, evolution and diversity, populations, communities and ecosystems, and topics related to biology and society. Not open to students who have earned credit for BSCI 1510 or 1511 without permission. Total credit for this course and BSCI 1510 or 1511 will not exceed 3 hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI1100L",
    "title": "Biology Today Laboratory",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": ["BSCI1100"],
      "description": "Biological Sciences"
    },
    "description": "Laboratory investigations of the genetics, physiology, and ecology of plants and animals. One three-hour laboratory per week to accompany 1100. Not open to students who have earned credit for BSCI 1510L, 1511L, or 1512L without permission. Total credit for this course and BSCI 1510L or 1511L will not exceed 1 credit hour; total credit for this course and BSCI 1512L will not exceed 2 credit hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Satisfies the AXLE lab course requirement when completed with 1100. Co- or pre-requisite: 1100. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI1103",
    "title": "Green Earth: The Biodiversity and Evolution of Plants",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": ["BSCI1103L"],
      "description": "Biological Sciences"
    },
    "description": "Evolution of biodiversity from the Cambrian period through today. Theories and challenges of its conservation. Case studies drawn from Hawaii, Madagascar and Australia. Not intended for students planning to major in biological sciences. Not open to students who have earned credit for 1510 or 1511 without permission. Total credit for this course and 1510 or 1511 will not exceed 3 credit hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI1103L",
    "title": "Green Earth Laboratory: The Biodiversity and Evolution of Land Plants",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": ["BSCI1103"],
      "description": "Biological Sciences"
    },
    "description": "Not open to students who have earned credit for 1510L, 1511L, or 1512L without permission. Total credit for this course and 1510L or 1511L will not exceed 1 credit hour; total credit for this course and 1512L will not exceed 2 credit hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Corequisite: 1103. Satisfies the AXLE lab course requirement when completed with 1103. [1]"
  },
  {
    "__catalogCourseId": "BSCI1510",
    "title": "Introduction to Biological Sciences",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["CHEM1601"],
      "corequisites": ["CHEM1601", "BSCI1510L"],
      "description": "Biological Sciences"
    },
    "description": "An integrative approach to the science of life for science and engineering students. Macromolecular structure and function. Cell structure, reproduction, metabolism, and energy production. Genomes, replication, gene structure, RNA, and protein synthesis. Not open to students who have earned credit for BSCI 1100, 1103, or 1105 without permission. Total credit for this course and BSCI 1100 or 1103 will not exceed 3 credit hours; total credit for this course and BSCI 1105 will not exceed 4 credit hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Prerequisite or corequisite: CHEM 1601. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI1510L",
    "title": "Biological Sciences Laboratory",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": ["BSCI1510"],
      "description": "Biological Sciences"
    },
    "description": "Laboratory to accompany 1510. One three-hour laboratory per week. Satisfies the AXLE lab course requirement when completed with 1510. Not open to students who have earned credit for BSCI 1100L, 1103L, or 1105L without permission. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI1511",
    "title": "Introduction to Biological Sciences",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1510"],
      "corequisites": ["BSCI1511L"],
      "description": "Biological Sciences"
    },
    "description": "Continuation of 1510. Cell communication. Physiology, organ function and development. Mendelian and population genetics. Evolution, ecology, and speciation. Populations, ecosystems, and conservation biology. Not open to students who have earned credit for BSCI 1100, 1103, or 1105 without permission. Total credit for this course and BSCI 1100 or 1103 will not exceed 3 credit hours; total credit for this course and BSCI 1105 will not exceed 4 credit hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Prerequisite: 1510. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI1511L",
    "title": "Biological Sciences Laboratory",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1510"],
      "corequisites": ["BSCI1511"],
      "description": "Biological Sciences"
    },
    "description": "Laboratory to accompany 1511. One three-hour laboratory per week. Satisfies the AXLE lab course requirement when completed with 1511. Not open to students who have earned credit for BSCI 1100L, 1103L, 1105, or 1512L without permission. Total credit for this course and BSCI 1100L or 1103L will not exceed 1 hour; total credit for this course and BSCI 1105 will not exceed 4 hours; total credit for this course and BSCI 1512L will not exceed 2 hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Prerequisite or corequisite: 1511. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI1512L",
    "title": "Biological Sciences Laboratory",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1510"],
      "corequisites": ["BSCI1511"],
      "description": "Biological Sciences"
    },
    "description": "Alternative to 1511L. Directed research projects with emphasis on experimental design and analysis. Satisfies the AXLE lab course requirement when completed with 1511. Offered on a graded basis only. Not open to students who have earned credit for BSCI 1100L, 1105, or 1511L without permission. Total credit for this course and BSCI 1100L or 1511L will not exceed 2 hours; total credit for this course and BSCI 1105 will not exceed 5 hours. Credit hours reduced from second course taken (or from test or transfer credit) as appropriate. Prerequisite or corequisite: 1511. Prerequisite: 1510L. [2] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI2210",
    "title": "Principles of Genetics",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Basic principles and mechanisms of inheritance discussed and related to other biological phenomena and problems. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI2210L",
    "title": "Genetics Laboratory",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI2210"],
      "corequisites": ["BSCI2210"],
      "description": "Biological Sciences"
    },
    "description": "One three-hour laboratory and discussion period per week. Satisfies the AXLE lab course requirement when completed with 2210. Prerequisite or corequisite: 2210. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI2238",
    "title": "Ecology",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Population biology, evolutionary ecology, community structure, with emphasis on species interactions, including competition, predation, and symbiosis. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI2520",
    "title": "Biochemistry",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [["BSCI1510", "CHBE2150"], ["CHEM2211", "CHEM2211"]],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Structures and mechanisms of action of biological molecules, proteins, nucleic acids, lipids, and polysaccharides. Enzymology. Carbohydrate metabolism. Prerequisite: Either 1510 or CHBE 2150; and either CHEM 2211 or 2221. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3230",
    "title": "Biological Clocks",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Study of innate mechanisms for measurement of time in living organisms. Emphasis on the functional significance and physiological basis of biological clocks in animals and humans. Topics include circadian rhythms, time-compensated celestial navigation, photoperiodism, and the role of biological clocks in human behavior. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3232",
    "title": "Biodiversity, Climate Change and Our Health",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Impacts of climate change on biological and ecological systems from the Paleozoic era to today. Inter-play of earth's systems, climate, and biological innovations. Effects on our natural resources, and consequences for our health. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3236",
    "title": "Parasitology",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Biology and epidemiology of eukaryotic parasites of medical and veterinary significance. Diagnosis, treatment, and control of parasitic protists, platyhelminthes, nematodes, and arthropods. Impact on global health. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3254",
    "title": "Neurobiology of Behavior",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [["BSCI1511"], ["NSC2201"]],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Nerve cell interactions in neuronal networks of the central nervous system of animals and their impact for regulating behavior. Sensory systems, sensory-motor integration, central processing of information, neuronal-hormonal interactions; and brain anatomy and organization in invertebrates and vertebrates. Prerequisite: BSCI 1511 or NSC 2201. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3270",
    "title": "Statistical Methods in Biology",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "An introduction to statistical methods used in the analysis of biological experiments, including the application of computer software packages. Emphasis on testing of hypotheses and experimental design. Topics include descriptive statistics, analysis of variance, regression, correlation, contingency analysis, and the testing of methods for sampling natural populations. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3850",
    "title": "Independent Reading",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Reading and discussion of research papers with a member of the faculty. Prerequisite: consent of Biological Sciences 3850 coordinator before the end of the previous semester. May be repeated for credit once if there is no duplication in topic. Students may enroll in more than one section of this course each semester. [1; maximum of 2 credits total for all semesters of BSCI 3850] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI3860",
    "title": "Introduction to Research",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1510", "BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Work in the laboratory of a member of the Biological Sciences faculty. Term paper required. Consent of course coordinator and enrollment by arrangement before the end of the previous semester is required. Prerequisite: 1510. Prerequisite or corequisite: 1511. [1] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI3861",
    "title": "Directed Laboratory Research",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511", "BSCI3860"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Directed student research on a project conceived by a member of the Biological Sciences faculty. Enrollment by arrangement before the end of the previous semester. May be taken only once, and participants ordinarily expected to have overall grade point average of B or better. Offered on a graded basis only. Prerequisite: 1511, one intermediate BSCI course appropriate to the major or 3860, and consent of Biological Sciences 3861 coordinator. [2-4] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI3890",
    "title": "Special Topics in Biological Sciences",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI1511"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Topics vary. May be repeated for credit more than once by permission of the director of undergraduate studies. Prerequisite: 1511. [3] (MNS)"
  },
  {
    "__catalogCourseId": "BSCI3961",
    "title": "Independent Laboratory Research",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": ["BSCI3861"],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Original student research on a defined problem in Biological Sciences and under the supervision of Biological Sciences faculty. Some independence in the design and execution of the problem. Enrollment by arrangement before the end of the previous semester. Prerequisite: 3861, consent of Biological Sciences 3961 coordinator, cumulative grade point average of B. May be repeated for credit more than once, but students may earn only up to 6 credits per semester of enrollment. [2-6] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI3965",
    "title": "Undergraduate Seminar",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Discussions and papers based on readings in research journals. Topics vary. Prerequisite: fulfillment of the intermediate course requirements for the major. May be repeated for credit more than once if there is no duplication in topic, but only two hours may count toward the major. Students may enroll in more than one section of this course each semester. [2] (No AXLE credit)"
  },
  {
    "__catalogCourseId": "BSCI4999",
    "title": "Honors Research",
    "subjectCode": {
      "name": "BSCI",
      "prerequisites": [],
      "corequisites": [],
      "description": "Biological Sciences"
    },
    "description": "Open only to majors in the Honors Program. May be repeated for credit more than once, but students may earn only up to 6 credits per semester of enrollment. [4-6] (No AXLE credit)"
  }
]